<?php

use Twig\Environment;
use Twig\Error\LoaderError;
use Twig\Error\RuntimeError;
use Twig\Extension\SandboxExtension;
use Twig\Markup;
use Twig\Sandbox\SecurityError;
use Twig\Sandbox\SecurityNotAllowedTagError;
use Twig\Sandbox\SecurityNotAllowedFilterError;
use Twig\Sandbox\SecurityNotAllowedFunctionError;
use Twig\Source;
use Twig\Template;

/* ProductOption/LICENSE.txt */
class __TwigTemplate_7484958dfec8599aec089bdbeb7d4fa0c1f9166af1a552fbfc37a82d905db2d7 extends \Eccube\Twig\Template
{
    private $source;
    private $macros = [];

    public function __construct(Environment $env)
    {
        parent::__construct($env);

        $this->source = $this->getSourceContext();

        $this->parent = false;

        $this->blocks = [
        ];
    }

    protected function doDisplay(array $context, array $blocks = [])
    {
        $macros = $this->macros;
        $__internal_085b0142806202599c7fe3b329164a92397d8978207a37e79d70b8c52599e33e = $this->extensions["Symfony\\Bundle\\WebProfilerBundle\\Twig\\WebProfilerExtension"];
        $__internal_085b0142806202599c7fe3b329164a92397d8978207a37e79d70b8c52599e33e->enter($__internal_085b0142806202599c7fe3b329164a92397d8978207a37e79d70b8c52599e33e_prof = new \Twig\Profiler\Profile($this->getTemplateName(), "template", "ProductOption/LICENSE.txt"));

        $__internal_319393461309892924ff6e74d6d6e64287df64b63545b994e100d4ab223aed02 = $this->extensions["Symfony\\Bridge\\Twig\\Extension\\ProfilerExtension"];
        $__internal_319393461309892924ff6e74d6d6e64287df64b63545b994e100d4ab223aed02->enter($__internal_319393461309892924ff6e74d6d6e64287df64b63545b994e100d4ab223aed02_prof = new \Twig\Profiler\Profile($this->getTemplateName(), "template", "ProductOption/LICENSE.txt"));

        // line 1
        echo "ソフトウェア使用許諾契約書

株式会社ブラテック（以下、「当社」といいます。）のソフトウェア製品（以下、「本ソフトウェア」といいます。）の使用権（以下、「ライセンス」といいます。）を購入された法人、団体（以下、「顧客」といいます。）は以下をよく読みご理解頂くようお願いします。

本使用許諾契約書（以下、「本契約書」といいます。）は、本ソフトウェアに関して顧客と当社との間に締結される契約書です。顧客は、本ソフトウェアライセンスのご購入（使用許諾の取得）の申込をもって本利用規約を了承したものとみなし、本契約書の条項に拘束されます。

本ソフトウェアはその利用を許諾されるもので販売されるものではありません。本ソフトウェアは、著作権法および著作権に関する条約をはじめ、その他の知的財産権に関する法律ならびにその条約によって保護されています。また本ソフトウェアには、当社が著作権を有しない第三者のプログラムが含まれます。（これらのプログラムには本契約書の効力は及びません）これらの使用条件に同意できない場合は、顧客は、本ソフトウェアを使用することはできません。


第１条（定義）
(1)「ライセンス」とは本契約書で許諾された範囲内において本ソフトウェアを利用することができる権利をいいます。

第2条（使用範囲）
(1) 本契約書により、当社は、顧客に対し本ソフトウェアを EC-CUBE 1サイトにて利用することを許諾します。
(2) 当社の顧客に対する本ソフトウェアの利用許諾は非独占的なものです。当社は顧客に利用を許諾したのと同じソフトウェアを顧客以外の第三者に許諾することがあります。

第3条（その他の条件）
(1)　顧客は、以下の各号に記載の目的においてのみ本ソフトウェアを複製することができます。
① 顧客のデータをバックアップする目的
② 本ソフトウェアの修正プログラムや、本ソフトウェアにおけるオプション製品等が顧客のご利用環境と適合するか否かを事前にテストする目的
(2)　顧客は、本ソフトウェアを顧客の所有する他のサーバーコンピュータに移管する際は、本ソフトウェアは、移管前のサーバーコンピュータからすべて消去されるものとします。
(3)　顧客は、本ソフトウェアを第三者に対して頒布、送信（自動公衆送信、送信可能化を含む）等を行なうことはできません。
(4)　顧客は、本ソフトウェアの貸与、リース、担保設定等を行なうことはできません。また顧客は、ライセンスを譲渡、転売、付与、あるいはその使用を再許諾することはできません。
(5)　顧客は、本ソフトウェアをリバースエンジニアリング、逆コンパイル、逆アセンブル、または本ソフトウェアの派生ソフトウェアを作成することはできません。また本ソフトウェアに関するドキュメントを修正、翻訳することはできません。

第4条（本契約の解除）
(1)　顧客が本契約の条項および条件の１つにでも違反した場合、当社は本契約をなんらの催告なくして解除することができます。
(2)　本契約が解除および終了となった場合、顧客は、本ソフトウェア、構成部分、ドキュメント、ならびにその一切の複製物を破棄、コンピュータの記憶媒体上から完全に消去し、使用を継続してはなりません。
(3)　本契約の解除および終了に伴って本ソフトウェアの全部または一部が利用不可能となることによって、顧客ならびに第三者が被った損害等について、当社は一切責任を負いません。

第5条（保証の制限）
(1)　当社は、本ソフトウェアに含まれた機能が顧客の要求を満足させるものであることを保証いたしません。
(2)　当社は本ソフトウェアの機能および本ソフトウェアに付随するサービス等について顧客の事前の許可なく変更・中止する場合があります。本契約締結時における本ソフトウェアと同等の使用環境を永続的に保証するものではありません。
(3)　本ソフトウェアを修正、改変された場合は保証の対象外となります。

第6条（免責）
いかなる場合においても当社は、本ソフトウェア製品の使用あるいは使用不能であることから生じる直接または間接のすべての損害（逸失利益、事業の中断、事業情報の喪失、またはその他の金銭的損失を含みますがこれらに限定されません）に関して一切の責任および義務から免れるものとします。

第7条（サポート）
ユーザーの利用上の不具合・要望に関する問い合わせは、電子メールによるものとし、これに対して当社はその多寡や重要度を個別に判断し、不定期の改良版のリリースを以ってこれにあたります。

第8条（プライバシーポリシー）
顧客情報の取扱いは、別途規定するプライバシーポリシーによるものとします。

第9条（準拠法）
(1)　本契約は、法の抵触に関する原則の適用を除いて日本国の法律を準拠法とします。
(2)　本契約書ないし本ソフトウェアに関して紛争が生じた場合には、福岡地方裁判所 小倉支部を第一審管轄裁判所とすることに顧客も当社も合意するものとします。
";
        
        $__internal_085b0142806202599c7fe3b329164a92397d8978207a37e79d70b8c52599e33e->leave($__internal_085b0142806202599c7fe3b329164a92397d8978207a37e79d70b8c52599e33e_prof);

        
        $__internal_319393461309892924ff6e74d6d6e64287df64b63545b994e100d4ab223aed02->leave($__internal_319393461309892924ff6e74d6d6e64287df64b63545b994e100d4ab223aed02_prof);

    }

    public function getTemplateName()
    {
        return "ProductOption/LICENSE.txt";
    }

    public function getDebugInfo()
    {
        return array (  43 => 1,);
    }

    public function getSourceContext()
    {
        return new Source("ソフトウェア使用許諾契約書

株式会社ブラテック（以下、「当社」といいます。）のソフトウェア製品（以下、「本ソフトウェア」といいます。）の使用権（以下、「ライセンス」といいます。）を購入された法人、団体（以下、「顧客」といいます。）は以下をよく読みご理解頂くようお願いします。

本使用許諾契約書（以下、「本契約書」といいます。）は、本ソフトウェアに関して顧客と当社との間に締結される契約書です。顧客は、本ソフトウェアライセンスのご購入（使用許諾の取得）の申込をもって本利用規約を了承したものとみなし、本契約書の条項に拘束されます。

本ソフトウェアはその利用を許諾されるもので販売されるものではありません。本ソフトウェアは、著作権法および著作権に関する条約をはじめ、その他の知的財産権に関する法律ならびにその条約によって保護されています。また本ソフトウェアには、当社が著作権を有しない第三者のプログラムが含まれます。（これらのプログラムには本契約書の効力は及びません）これらの使用条件に同意できない場合は、顧客は、本ソフトウェアを使用することはできません。


第１条（定義）
(1)「ライセンス」とは本契約書で許諾された範囲内において本ソフトウェアを利用することができる権利をいいます。

第2条（使用範囲）
(1) 本契約書により、当社は、顧客に対し本ソフトウェアを EC-CUBE 1サイトにて利用することを許諾します。
(2) 当社の顧客に対する本ソフトウェアの利用許諾は非独占的なものです。当社は顧客に利用を許諾したのと同じソフトウェアを顧客以外の第三者に許諾することがあります。

第3条（その他の条件）
(1)　顧客は、以下の各号に記載の目的においてのみ本ソフトウェアを複製することができます。
① 顧客のデータをバックアップする目的
② 本ソフトウェアの修正プログラムや、本ソフトウェアにおけるオプション製品等が顧客のご利用環境と適合するか否かを事前にテストする目的
(2)　顧客は、本ソフトウェアを顧客の所有する他のサーバーコンピュータに移管する際は、本ソフトウェアは、移管前のサーバーコンピュータからすべて消去されるものとします。
(3)　顧客は、本ソフトウェアを第三者に対して頒布、送信（自動公衆送信、送信可能化を含む）等を行なうことはできません。
(4)　顧客は、本ソフトウェアの貸与、リース、担保設定等を行なうことはできません。また顧客は、ライセンスを譲渡、転売、付与、あるいはその使用を再許諾することはできません。
(5)　顧客は、本ソフトウェアをリバースエンジニアリング、逆コンパイル、逆アセンブル、または本ソフトウェアの派生ソフトウェアを作成することはできません。また本ソフトウェアに関するドキュメントを修正、翻訳することはできません。

第4条（本契約の解除）
(1)　顧客が本契約の条項および条件の１つにでも違反した場合、当社は本契約をなんらの催告なくして解除することができます。
(2)　本契約が解除および終了となった場合、顧客は、本ソフトウェア、構成部分、ドキュメント、ならびにその一切の複製物を破棄、コンピュータの記憶媒体上から完全に消去し、使用を継続してはなりません。
(3)　本契約の解除および終了に伴って本ソフトウェアの全部または一部が利用不可能となることによって、顧客ならびに第三者が被った損害等について、当社は一切責任を負いません。

第5条（保証の制限）
(1)　当社は、本ソフトウェアに含まれた機能が顧客の要求を満足させるものであることを保証いたしません。
(2)　当社は本ソフトウェアの機能および本ソフトウェアに付随するサービス等について顧客の事前の許可なく変更・中止する場合があります。本契約締結時における本ソフトウェアと同等の使用環境を永続的に保証するものではありません。
(3)　本ソフトウェアを修正、改変された場合は保証の対象外となります。

第6条（免責）
いかなる場合においても当社は、本ソフトウェア製品の使用あるいは使用不能であることから生じる直接または間接のすべての損害（逸失利益、事業の中断、事業情報の喪失、またはその他の金銭的損失を含みますがこれらに限定されません）に関して一切の責任および義務から免れるものとします。

第7条（サポート）
ユーザーの利用上の不具合・要望に関する問い合わせは、電子メールによるものとし、これに対して当社はその多寡や重要度を個別に判断し、不定期の改良版のリリースを以ってこれにあたります。

第8条（プライバシーポリシー）
顧客情報の取扱いは、別途規定するプライバシーポリシーによるものとします。

第9条（準拠法）
(1)　本契約は、法の抵触に関する原則の適用を除いて日本国の法律を準拠法とします。
(2)　本契約書ないし本ソフトウェアに関して紛争が生じた場合には、福岡地方裁判所 小倉支部を第一審管轄裁判所とすることに顧客も当社も合意するものとします。
", "ProductOption/LICENSE.txt", "/var/www/htdocs/ec922501/app/Plugin/ProductOption/LICENSE.txt");
    }
}
